ConfigFiles/InformationRegisters/ХронометражРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ХронометражРабочегоВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/КалендариПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КалендариПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехническийПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗамещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Повторяется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПовторения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаленный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПовторения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/AccumulationRegisters/УчетВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УчетВремени</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТехническийПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОписаниеРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ConfigFiles/Catalogs/ЗадачиПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроцесса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиШаблонаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролирующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительПорученияПоЗадаче</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДлительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПорученияПоЗадаче</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтработкиПоручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредшествующиеЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредшествующаяЗадача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПротоколВзаимодействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПоручения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительПоручения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/CommonModules/УчетВремени/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьФормуДляУчетаЗатратВремени(Форма) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетВремени") Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЕжедневныеОтчеты1СДокументооборота") Тогда
			
			// Отключаются команды интеграции с ДО, если ведется учет затрат времени внутри
			ИмяЭлемента = "ИнтеграцияС1СДокументооборотом_ПереключитьХронометраж";
			ОтключитьВидимостьЭлемента(Форма, ИмяЭлемента);
			
			ИмяЭлемента = "ИнтеграцияС1СДокументооборотом_УказатьТрудозатраты";
			ОтключитьВидимостьЭлемента(Форма, ИмяЭлемента);
			
		КонецЕсли;
		
		НастроитьКомандуХронометража(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьКомандуХронометража(Форма) Экспорт
	
	КнопкаХронометража = Форма.Элементы.Найти("ПереключитьХронометраж");
	
	Если КнопкаХронометража <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(Форма.Объект.Ссылка) И Форма.ДоступноИзменениеХронометража Тогда
			
			КнопкаХронометража.Доступность = Истина;
			Если ХронометражВключен(Форма.ТекущийПользователь, Форма.Объект.Ссылка, "") Тогда
				КнопкаХронометража.Пометка = Истина;
			Иначе
				КнопкаХронометража.Пометка = Ложь;
			КонецЕсли;
		Иначе
			КнопкаХронометража.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПереключитьХронометраж(Работа, ОписаниеРаботы="", НовоеОписаниеРаботы=Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	ТекущаяДата = НачалоМинуты(ТекущаяДатаСеанса());
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Результат.Вставить("Пользователь", ТекущийПользователь);
	Результат.Вставить("Работа", Работа);
	Результат.Вставить("ОписаниеРаботы", ОписаниеРаботы);
	Результат.Вставить("ЗавершеннаяРабота", Неопределено);
	Результат.Вставить("ХронометражЗавершен", Ложь);
	Результат.Вставить("ХронометражВключен", Ложь);
	
	МенеджерЗаписи = РегистрыСведений.ХронометражРабочегоВремени.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = ТекущийПользователь;
	
	МенеджерЗаписи.Прочитать();
	
	ЗавершеннаяРабота = Неопределено;
	ОписаниеЗавершеннойРаботы = "";
	
	Если НовоеОписаниеРаботы <> Неопределено Тогда
		ОписаниеРаботыДляКалендаря = НовоеОписаниеРаботы;
	Иначе
		ОписаниеРаботыДляКалендаря = ОписаниеРаботы;
	КонецЕсли;
	
	Если МенеджерЗаписи.Выбран() Тогда
		// Хронометраж включен, следует зафиксировать окончание работы и выключить хронометраж
		
		Если МенеджерЗаписи.Начало < НачалоДня(ТекущаяДата) Тогда
			
			Начало = НачалоДня(ТекущаяДата);
			
			// Если хронометраж переходит через сутки, Фиксируется работа за предыдущий день
			НачалоПредыдущегоДня = НачалоДня(ТекущаяДата-86400);
			
			Если МенеджерЗаписи.Начало > НачалоПредыдущегоДня Тогда
				НачалоРаботыВПредыдущийДень = МенеджерЗаписи.Начало;
			Иначе
				НачалоРаботыВПредыдущийДень = НачалоПредыдущегоДня;
			КонецЕсли;
			
			ОкончаниеРаботыВПредыдущийДень = НачалоМинуты(КонецДня(НачалоПредыдущегоДня));
			
			РегистрыСведений.КалендариПользователей.ЗанестиРаботуВКалендарь(ТекущийПользователь,
		                                                                    МенеджерЗаписи.Работа,
																		    НачалоРаботыВПредыдущийДень,
																		    ОкончаниеРаботыВПредыдущийДень,
																		    ОписаниеРаботыДляКалендаря,
																			Истина);
																		
		Иначе
			Начало = МенеджерЗаписи.Начало;
		КонецЕсли;
		
		РегистрыСведений.КалендариПользователей.ЗанестиРаботуВКалендарь(ТекущийПользователь,
		                                                                МенеджерЗаписи.Работа,
																		Начало,
																		ТекущаяДата,
																		ОписаниеРаботыДляКалендаря,
																		Истина);
		
		ЗавершеннаяРабота = МенеджерЗаписи.Работа;
		ОписаниеЗавершеннойРаботы = МенеджерЗаписи.ОписаниеРаботы;
		
		МенеджерЗаписи.Удалить();
		
		Результат.Вставить("ЗавершеннаяРабота", ЗавершеннаяРабота);
		Результат.Вставить("ОписаниеРаботы", ОписаниеЗавершеннойРаботы);
		Результат.Вставить("ХронометражЗавершен", Истина);
		Результат.Вставить("НачалоЗавершеннойРаботы", Начало);
		Результат.Вставить("ОкончаниеЗавершеннойРаботы", ТекущаяДата);
		
	КонецЕсли;
	
	Если Работа <> ЗавершеннаяРабота ИЛИ ОписаниеРаботы <> ОписаниеЗавершеннойРаботы Тогда
		
		// Нужно стартовать хронометраж
		МенеджерЗаписи.Пользователь = ТекущийПользователь;
		МенеджерЗаписи.Работа = Работа;
		МенеджерЗаписи.ОписаниеРаботы = ОписаниеРаботы;
		МенеджерЗаписи.Начало = ТекущаяДата;
		
		МенеджерЗаписи.Записать();
		
		Результат.Вставить("ХронометражВключен", Истина);
		Результат.Вставить("Начало", ТекущаяДата);
		Результат.Вставить("Окончание", '00010101');
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ХронометражВключен(Пользователь, Работа, ОписаниеРаботы="") Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХронометражРабочегоВремени.Начало КАК Начало
	|ИЗ
	|	РегистрСведений.ХронометражРабочегоВремени КАК ХронометражРабочегоВремени
	|ГДЕ
	|	ХронометражРабочегоВремени.Пользователь = &Пользователь
	|	И ХронометражРабочегоВремени.Работа = &Работа
	|	И ХронометражРабочегоВремени.ОписаниеРаботы = """""
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Работа", Работа);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ДанныеАвтоподбораРабот(Текст, Пользователь) Экспорт
	
	Период = Новый СтандартныйПериод;
	
	ПериодИзНастроек = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("УчетВремениПодборРабот", "Период");
	
	Если ТипЗнч(ПериодИзНастроек) = Тип("СтандартныйПериод") Тогда
		Период = ПериодИзНастроек;
	Иначе
		Период.Вариант = ВариантСтандартногоПериода.Месяц;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УчетВремениОбороты.ВидДеятельности КАК ВидДеятельности,
	|	УчетВремениОбороты.Проект КАК Проект,
	|	ВЫБОР
	|		КОГДА УчетВремениОбороты.Задача <> ЗНАЧЕНИЕ(Справочник.ЗадачиПроцесса.ПустаяСсылка)
	|			ТОГДА УчетВремениОбороты.Задача
	|		КОГДА УчетВремениОбороты.Ошибка <> ЗНАЧЕНИЕ(Справочник.Ошибки.ПустаяСсылка)
	|			ТОГДА УчетВремениОбороты.Ошибка
	|		КОГДА УчетВремениОбороты.ТехническийПроект <> ЗНАЧЕНИЕ(Справочник.ТехническиеПроекты.ПустаяСсылка)
	|			ТОГДА УчетВремениОбороты.ТехническийПроект
	|	КОНЕЦ КАК Работа,
	|	УчетВремениОбороты.ОписаниеРаботы КАК ОписаниеРаботы,
	|	УчетВремениОбороты.ВидДеятельности.ВидВремени КАК ВидВремени
	|ИЗ
	|	РегистрНакопления.УчетВремени.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			День,
	|			Пользователь = &Пользователь
	|				И ОписаниеРаботы ПОДОБНО &Текст) КАК УчетВремениОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОписаниеРаботы,
	|	Работа,
	|	Проект,
	|	ВидДеятельности"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Текст", Текст + "%");
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеРаботы = Новый Структура;
		ДанныеРаботы.Вставить("ОписаниеРаботы", Выборка.ОписаниеРаботы);
		ДанныеРаботы.Вставить("Работа", Выборка.Работа);
		ДанныеРаботы.Вставить("Проект", Выборка.Проект);
		ДанныеРаботы.Вставить("ВидДеятельности", Выборка.ВидДеятельности);
		ДанныеРаботы.Вставить("ВидВремени", Выборка.ВидВремени);
		
		ДанныеВыбора.Добавить(ДанныеРаботы, ДанныеРаботы.ОписаниеРаботы);
		
	КонецЦикла;	
	
	Возврат ДанныеВыбора;
	
КонецФункции

Функция ДанныеХронометража(Пользователь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Работа", Неопределено);
	Результат.Вставить("Начало", '00010101');
	Результат.Вставить("ОписаниеРаботы", "");
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХронометражРабочегоВремени.Работа КАК Работа,
	|	ХронометражРабочегоВремени.ОписаниеРаботы КАК ОписаниеРаботы,
	|	ХронометражРабочегоВремени.Начало КАК Начало
	|ИЗ
	|	РегистрСведений.ХронометражРабочегоВремени КАК ХронометражРабочегоВремени
	|ГДЕ
	|	ХронометражРабочегоВремени.Пользователь = &Пользователь"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПроцедурыИФункции

Процедура ОтключитьВидимостьЭлемента(Форма, ИмяЭлемента)
	
	ЭлементФормы = Форма.Элементы.Найти(ИмяЭлемента);
	Если ЭлементФормы <> Неопределено Тогда
		ЭлементФормы.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
